{
  "stutterfix.name": "StutterFix",
  "stutterfix.options.name": "StutterFix Options",
  "stutterfix.options.worker_threads": "Worker threads count",
  "stutterfix.options.threads": "%s threads",
  "stutterfix.options.worker_threads.tooltip": "It is the number of threads running to perform tasks such as generating chunks. The smaller the value, the less CPU overhead, reducing stuttering, and the slower the chunk generation speed. \n\n Default vanilla: %s \n Default StutterFix: %s",
  "stutterfix.options.Worker_threads_priority_cut": "Priority cutoff point",
  "stutterfix.options.priority_cut": "%s",
  "stutterfix.options.Worker_threads_priority_cut.tooltip": "Indicates the cutoff point for the priority of worker threads. The higher the value, the higher the first part of the threads will be with normal priority and the lower the last part will be with minimum priority. The value must be less than the number of worker threads to have the cutoff point, otherwise all threads will have normal priority. Threads with minimum priority help reduce stuttering.",
  "stutterfix.options.render_thread_priority": "Render thread priority",
  "stutterfix.options.render_thread_priority.tooltip": "The rendering thread is where the client runs, such as the player, sound, inputs, and rendering. \n\n Default vanilla: %s",
  "stutterfix.options.server_thread_priority": "Server thread priority",
  "stutterfix.options.server_thread_priority.tooltip": "In singleplayer mode, the game starts the integrated server that runs the entire world, such as ticks, entities and initializing the generation of chunks (which will be executed in the worker threads). This option only appears when playing in a world in singleplayer mode. \n\n Default vanilla: %s",
  "stutterfix.options.thread_priority": "%s",
  "stutterfix.options.remove_yield": "Remove Yield()",
  "stutterfix.options.remove_yield.tooltip": "The rendering thread has a call made in each loop, called yield(), with the function of informing the “scheduler” that the current thread is willing to abandon the current use of the processor to other threads. Removing yield() can make fps more stable. \n\n Default vanilla: Keep",
  "stutterfix.options.remove": "Remove",
  "stutterfix.options.keep": "Keep"
}

